benchmarks/02-postgres.txt
Step 2: short links in Postgres, no index, default connection pool
Commit:  (this step)
Date:    2026-09-04 13:03 IST
Machine: Apple M5, 10 cores, macOS 26.6.2
Go:      go1.26.4
hey:     v0.1.5
Postgres: 18.3 (Homebrew)

The server, the load generator and Postgres all ran on the same machine and
shared its CPUs.

Table: 500,000 rows, 40 MB, no index of any kind.

Command:
  hey -z 20s -c 50 -disable-redirects http://localhost:8080/seed250000

Query plan for the lookup this test performs:

  explain (analyze, buffers) select url from links where code = 'seed250000';

                                                        QUERY PLAN                                                       
  -----------------------------------------------------------------------------------------------------------------------
   Gather  (cost=1000.00..8758.27 rows=1 width=31) (actual time=18.120..19.936 rows=1.00 loops=1)
     Workers Planned: 2
     Workers Launched: 2
     Buffers: shared hit=5154
     ->  Parallel Seq Scan on links  (cost=0.00..7758.17 rows=1 width=31) (actual time=14.798..15.181 rows=0.33 loops=3)
           Filter: (code = 'seed250000'::text)
           Rows Removed by Filter: 166667
           Buffers: shared hit=5154
   Planning:
     Buffers: shared hit=32
   Planning Time: 0.496 ms
   Execution Time: 20.017 ms
  (12 rows)
  

----------------------------- raw hey output -----------------------------


Summary:
  Total:	20.0743 secs
  Slowest:	0.4320 secs
  Fastest:	0.0093 secs
  Average:	0.1265 secs
  Requests/sec:	394.7831
  
  Total data:	427950 bytes
  Size/request:	54 bytes

Response time histogram:
  0.009 [1]	|
  0.052 [2687]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.094 [1376]	|■■■■■■■■■■■■■■■■■■■■
  0.136 [324]	|■■■■■
  0.178 [542]	|■■■■■■■■
  0.221 [1194]	|■■■■■■■■■■■■■■■■■■
  0.263 [1233]	|■■■■■■■■■■■■■■■■■■
  0.305 [473]	|■■■■■■■
  0.347 [87]	|■
  0.390 [7]	|
  0.432 [1]	|


Latency distribution:
  10%% in 0.0251 secs
  25%% in 0.0398 secs
  50%% in 0.0871 secs
  75%% in 0.2147 secs
  90%% in 0.2534 secs
  95%% in 0.2727 secs
  99%% in 0.3085 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0035 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0022 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.1264 secs, 0.0093 secs, 0.4319 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [302]	7925 responses